import { FC, useEffect } from "react";
import { classes } from "../../../functions";
import { useProperty } from "../../hooks/property";
import { Typography } from "../../typography";
import { DropDown } from "./components/dropdown";

interface Props {
   onChange: (index: number) => void;
}

const HorizontalMenu: FC<Props> = ({ onChange }) => {

   const [menuItems] = useProperty([
      "Доставка",
      "Оплата",
   ]);

   const [active] = useProperty(0);

   useEffect(() => {
      onChange(active.get);
   }, [active.get]);

   return (
      <div className="overflow-x-scroll md:overflow-x-hidden overflow-y-hidden">
         <div className="bg-white w-full min-w-max h-[67px] 2xl:h-[100px] rounded-xl px-12">
            <ul className="flex h-full font-[Gotham] text-[17px] 2xl:text-[25px] font-bold items-center gap-x-8 2xl:gap-x-12">
               {menuItems.get.map((item, index) => (
                  <li onClick={() => active.set(index)} key={index} className={classes(
                     "min-w-fit leading-[66px] 2xl:leading-[98px] border-[#00FF74] cursor-pointer",
                     active.get === index ? "border-b-4" : ""
                  )}>{item}</li>
               ))}
            </ul>
         </div>
      </div>
   );
};

const DeliveryAndPaymentPage: FC = () => {

   const aboutTextList = [
      {
         label: "Загальні умови",
         text: "Термін резерву – 2 дні від планованої дати видачі. Дата видачі вказується під час підтвердження замовлення. Доступна оплата подарунковим сертифікатом. Ви можете оплатити замовлення у магазині карткою або готівкою. Ви можете відмовитися від частини замовлення. У всіх наших магазинах і точках видачі є примірювальні."
      },
      {
         label: "Самовивіз алкоголю і великої побутової техніки",
         text: 'Алкогольні напої та велика побутова техніка доставляються не у всі магазини. Доступні точки видачі ви побачите в кошику на етапі оформлення замовлення.'
      },
      {
         label: "Як замовити товар до мобільної точки видачі?",
         text: "Як замовити Виберіть товар та оплату карткою. Виберіть спосіб оплати «Самовивіз з мобільних точок видачі» і точку самовивозу. Підтвердьте та оплатіть замовлення онлайн. Отримайте замовлення із документом, що посвідчує особу. Умови доставки Доставка безкоштовна. Термін зберігання замовлення – 1 день після планованої дати видачі. Доставляються тільки малогабаритні товари за передоплатою. Ювелірні вироби та алкоголь не доставляються."
      },
   ];

   const aboutTextListTwo = [
      {
         label: "Які умови доставки кур’єром Bazar?",
         text: "Ви можете замовити доставку кур'єром Bazar. Послуга доступна тільки в деяких містах і областях. Інформація про можливість доставки кур'єром Rozetka вказана на сторінці товару (не забудьте вказати населений пункт) або в блоці доставка при підтвердженні замовлення на сайті. Вартість кур'єрської доставки - від 59 до 150 грн в залежності від населеного пункту. Точна вартість доставки розраховується під час оформлення замовлення. Будьте уважні та коректно вказуйте місто доставки. При доставці замовлення кур'єром Rozetka у вас є можливість оплатити замовлення готівкою або платіжною карткою. Оплата карткою при отриманні має певні обмеження. Вартість підйому розраховується автоматично під час підтвердження замовлення та залежить від розміру, ваги, поверху і наявності ліфта. Зверніть увагу, товари, які важать від 100кг - не підіймаються. * Розрахунок підйому працює в тестовому режимі - лише на повній версіі сайту (для ПК). Для мобільних застосунків вартість підйому можна дізнатися на лініях підтримки або безпосередньо у кур'єра. Незабаром розрахунок з'явиться і в застосунках. * Кур’єр заносить товар в офісні будівлі лише за наявності місця для паркування автомобіля і в супроводі отримувача. * Працівники компанії не заносять товари: у торговельні та розважальні центри, лікарні, гуртожитки, навчальні заклади, на ринки, станції громадського транспорту (метро, зупинки, аеропорти, вокзали)."
      },
      {
         label: "Які умови доставки кур’єром Нової Пошти?",
         text: "Умови доставки Термін доставки: 3-5 днів. Коли замовлення надійде у ваш населений пункт, з вами зв’яжеться працівник Нової пошти для узгодження терміну доставки. Оплата пластиковим подарунковим сертифікатом недоступна. Є можливість використання електронного подарункового сертифіката. Максимальна сума оплати готівкою – 49 999грн. Алкогольні напої доставляються лише за передоплати: безготівковим розрахунком або карткою, GPay, ApplePay, PrivatPay Підіймання на поверх Підіймання габаритних вантажів оплачується окремо. Необхідність надання послуги та її розрахункову вартість вказує магазин під час оформлення замовлення."
      },
      {
         label: "Які умови доставки на поштомат від Нової Пошти?",
         text: "Умови доставки Термін доставки: 3-5 днів. Коли замовлення надійде у ваш населений пункт, з вами зв’яжеться працівник Нової пошти для узгодження терміну доставки. Оплата пластиковим подарунковим сертифікатом недоступна. Є можливість використання електронного подарункового сертифіката. Максимальна сума оплати готівкою – 49 999грн. Алкогольні напої доставляються лише за передоплати: безготівковим розрахунком або карткою, GPay, ApplePay, PrivatPay Підіймання на поверх Підіймання габаритних вантажів оплачується окремо. Необхідність надання послуги та її розрахункову вартість вказує магазин під час оформлення замовлення."
      },
   ];

   const paymentTextList = [
      {
         label: "Як розрахуватися карткою при доставці?",
         text: ""
      },
      {
         label: "Як розрахуватися готівкою при доставці?",
         text: ""
      },
      {
         label: "Як використовувати промокод?",
         text: ""
      },
   ];

   const paymentTextListTwo = [
      {
         label: "Оплата онлайн картою \"єПідтримка\"",
         text: ""
      },
      {
         label: "Як оплатити замовлення карткою?",
         text: ""
      },
      {
         label: "Як використовувати промокод?",
         text: ""
      },
   ];

   const paymentTextListThree = [
      {
         label: "Як оформити оплату частинами без карток та паперів від BAZAR?",
         text: ""
      },
      {
         label: "Як купити в оплату частинами від ПриватБанку?",
         text: ""
      },
      {
         label: "Як скористатися миттєвою розстрочкою від ПриватБанку?",
         text: ""
      },
      {
         label: "Як оформити покупку частинами з monobank?",
         text: ""
      },
   ];

   const [menu] = useProperty(0);

   return (
      <div className="flex flex-col m-[20px] space-y-[20px]">
         <Typography.Heading>способи оплати та доставки</Typography.Heading>
         <HorizontalMenu onChange={menu.set} />

         <div className="md:flex md:w-full md:justify-center">
            <div className="md:w-[880px] md:space-y-[20px]">
               {menu.get === 0 && (
                  <>
                     <div>
                        <Typography.Heading>Як діє доставка до точок видачі Bazar?</Typography.Heading>
                     </div>
                     <div className="space-y-[5px]">
                        {aboutTextList.map((item, index) => (
                           <DropDown key={index} label={item.label} text={item.text} />
                        ))}
                     </div>

                     <div>
                        <Typography.Heading>{"Як діє кур'єрська доставка ?"}</Typography.Heading>
                     </div>
                     <div className="space-y-[5px]">
                        {aboutTextListTwo.map((item, index) => (
                           <DropDown key={index} label={item.label} text={item.text} />
                        ))}
                     </div>
                  </>
               )}

               {menu.get === 1 && (
                  <>
                     <div>
                        <Typography.Heading>Оплата при доставці</Typography.Heading>
                     </div>
                     <div className="space-y-[5px]">
                        {paymentTextList.map((item, index) => (
                           <DropDown key={index} label={item.label} text={item.text} />
                        ))}
                     </div>

                     <div>
                        <Typography.Heading>Оплата онлайн</Typography.Heading>
                     </div>
                     <div className="space-y-[5px]">
                        {paymentTextListTwo.map((item, index) => (
                           <DropDown key={index} label={item.label} text={item.text} />
                        ))}
                     </div>

                     <div>
                        <Typography.Heading>Кредитування та розстрочка</Typography.Heading>
                     </div>
                     <div className="space-y-[5px]">
                        {paymentTextListThree.map((item, index) => (
                           <DropDown key={index} label={item.label} text={item.text} />
                        ))}
                     </div>
                  </>
               )}
            </div>
         </div>
      </div>
   );
};

export { DeliveryAndPaymentPage };
